
# дополнительные операции с целыми числами

# модулль
print((abs(-6)))

# побитовое И
print(4 & 6)

# побитовое ИЛИ
print(4 | 6)

# побитовое исключающее ИЛИ
print(4 ^ 6)

# битовый сдвиг влево
print(4 << 6)

# битовый сдвиг вправо
print(4 >> 6)

# системы счисления и преобразование

# преобразование к цлому числу в десятичном формате
print(int(17.5))

# можно выбрать другую систему счисления с помощью параметра
print(int('10001', 2))

# преобразование к двоичному формату
print(bin(17))

# преобразование к восьмиричному формату
